Revit 2027 API
LightGroup.Id Property
 The ElementId of the LightGroup
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId Id { get; }
Public ReadOnly Property Id As ElementId
	Get
public:
property ElementId^ Id {
	ElementId^ get ();
}
member Id : ElementId with get
Property Value
ElementId
See Also
Reference
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace